{
  "cards": [
    {
      "header": "Gödel, Einstein, and Wittgenstein: Another Eternal Golden Braid",
      "date": "12/28/2025",
      "paragraphs": [
        "<b><em>Vikram Ramavarapu</em> 12/28/2025</b>",
        "",
        "<b>Some disclaimers before we begin:</b>",
        [
          "I'm not a philosopher nor a physicist. These are just some thoughts I've gathered through various readings and musings. I'm super fascinated by these topics especially as of late, and thought it would be fun to jot down some of my reflections.",
          "I'm open to corrections, pushback and feedback! Feel free to reach out to me on the links provided on my website.",
          "This is a work in progress. I'll likely update this entry as I gather more thoughts and references, and learn more about the topics discussed herein."
        ],
        "<b>Introduction</b>",
        "",
        "AGI (artificial general intelligence) is, other than being a buzzword, a concept that has been debated for a very long time. While it's definition may vary, for this entry, I will be using Wikipedia's definition for AI:",
        "```",
        "Artificial general intelligence–sometimes called human‑level AI—",
        "is a hypothetical type of artificial intelligence",
        "that would match or surpass human capabilities across virtually all cognitive tasks.",
        "```",
        "There's a lot of discussion around what AGI is and whether or not it's achievable. One argument I've seem a lot more often recently is that AGI is impossible due to Gödel's incompleteness theorems, which state two main things about formal systems:",
        [
          "Any sufficiently powerful formal system is either incomplete or inconsistent.",
          "No consistent formal system can prove its own consistency."
        ],
        "<b>I. Gödel's Incompleteness Theorems</b>",
        "",
        "Let's home in on the first theorem for now, and take a small step back. If you're anything like me you're probably asking, 'well what does completeness even mean?' A formal system is considered complete if every statement that is true within the system can be proven using the rules and axioms of the system. In other words, if a statement is true, there exists a proof for it within the system. Conversely, a formal system is incomplete if there are true statements that cannot be proven within the system. Gödel's first incompleteness theorem states that in any sufficiently powerful formal system (specifically, one capable of handling arithmetic), there will always be true statements that cannot be proven within that system. Gödel demonstrated this with one single statement:",
        "```",
        "'This statement is not provable within this system.'",
        "```",
        "If the system could prove this statement, it would lead to a contradiction, as the statement asserts that it is not provable. On the other hand, if the system cannot prove the statement, then it is indeed true, but unprovable within the system. This self-referential nature of Gödel's statement highlights the inherent limitations of formal systems. A simple liar's paradox is all you need to break such a system.",
        "Now, how does this relate to AGI? The argument goes that if we were to create an AGI based on a formal system (like a set of rules or algorithms), it would inevitably be subject to Gödel's incompleteness theorems. This means that there would always be true statements that the AGI cannot prove or understand, leading to limitations in its intelligence and capabilities.",
        "This argument seems pretty sound. However, with caveats. For one, Gödel's theorems are limited within the context of formal systems. More specifically, the theorems are limited to <em>provability</em> within a formal system. It's unclear whether or not intelligence itself is limited within these constraints. Moreover, it is also unclear whether the knowledge space that AGI, and even our own intelligence operates within the logical constraints of these theorems.  ",
        "",
        "All this said, provability is still a form of knowledge, and if there are true statements that cannot be proven within a system, then it follows that there are limits to what can be known within that system. Moreover, some other philosophical frameworks consider informal systems to be a perfectly valid form of logical reasoning. It is not that these arguments are necessarily wrong, but rather that they are not painting the full picture. There are many other factors to consider and as such we need to turn to other supporting theories to get a more holistic understanding of intelligence itself.",
        "<b>II. Einsteinian Incompleteness</b>",
        "",
        "In the realm of quantum mechanics, Einstein famously argued that quantum mechanics was incomplete because it could not provide a deterministic description of physical reality. Incompleteness in this context refers to a mapping between mathematical formalism and the underlying physical reality. Einstein's argument suggests that there are aspects of reality that cannot be fully captured by the mathematical framework of quantum mechanics, leading to an incomplete understanding of the physical world. While this argument is different from Gödel's incompleteness theorems, it shares a similar theme of limitations in knowledge and understanding. Perhaps there were very thoughtful discussions between them during their walks in Princeton~",
        "But then with respect to AGI there's an important caveat to consider here as well. Einstein's incompleteness argument is based on the representability of physical reality within the framework of the quantum wavefunction. Artificial general intelligence operates within the realm of matrices, vectors and algorithms. Can one really draw a parallel between the two? While it may be unclear, this can be explored mathematically. An AGI system (whether it uses a classical or quantum computer) can be represented as a discrete system of states and transitions. A state can be seen as a vector ($\\mathbb{R}^d$) representation of a piece of real world information, and transitions can be seen as functions ($f: \\mathbb{R}^{d_1} \\rightarrow \\mathbb{R}^{d_2}$) that map one state to another. Now, we can ask, how many such representations can exist in theory?",
        "For the sake of simplicitly, we can reduce this to the question of how many such functions, $f: \\mathbb{R}^{d_1} \\rightarrow \\mathbb{R}^{d_2}$ can exist in theory? This is uncountably infinite, but more specifically:",
        "$$c = 2^{\\aleph_0}$$",
        "Where $\\aleph_0$ is the cardinality of the set of natural numbers (i.e. countably infinite).",
        "Let's compare this to the size of everything representable by the wavefunction, $\\psi$. The wavefunction is a mathematical description of the quantum state of a system, and it can be represented as a vector in a complex Hilbert space. The size can therefore be represented as:",
        "$$d = |\\psi: \\mathbb{R} \\rightarrow \\mathbb{C}|$$",
        "$$=|L^2(\\mathbb{R^3})|$$",
        "$$\\geqq 2^{c}$$",
        "Where $L^2(\\mathbb{R^3})$ is the space of square-integrable functions over three-dimensional real space. In other words the size of every function such that:",
        "$$\\int_{\\mathbb{R^3}} |\\psi(x)|^2 dx < \\infty$$",
        "This means that the size of everything representable by the wavefunction is strictly larger than the size of everything representable by an AGI system. Therefore, if Einstein's incompleteness argument holds, then AGI systems are also incomplete in the sense that there are aspects of physical reality that cannot be fully captured by the mathematical framework of AGI systems.",
        "Finally, let's revisit Gödel's incompleteness theorems in the context of Wittgenstein's perspectives on proof.",
        "<b>III. Wittgenstein's Perspectives on Proof</b>",
        "",
        "Wittgenstein had a unique perspective on proof and logical reasoning. In the eyes of Wittgenstein, a proof is not just a formal sequence of logical steps, but rather a social practice that is embedded in a particular context. He argued that the meaning of a proof is not determined solely by its formal structure, but also by the way it is used and understood within a community of practitioners. To provide a quote:",
        "```",
        "proof is an ‘instrument of language’.",
        "```",
        "This perspective challenges the traditional view of proof as a purely formal and objective process. Instead, Wittgenstein emphasizes the importance of context, interpretation, and social interaction in shaping our understanding of proofs. Under this framework, one can see language, or any expression of thought, as a logical system that encompasses the formal systems discussed by Gödel and Einstein. Therefore, through the lens of Wittgenstein, the more abstract domain through which an AGI operates and reasons can also be seen as inherently incomplete.",
        "<b>Conclusion</b>",
        "",
        "Bringing it all together, we can see that there are multiple perspectives that suggest inherent limitations in knowledge and understanding. Gödel's incompleteness theorems highlight the limitations of formal systems, Einstein's incompleteness argument points to the limitations of mathematical frameworks in capturing physical reality, and Wittgenstein's perspectives bridge the incompleteness of formal systems to more abstract domains of reasoning. While these arguments may not definitively prove that AGI is impossible, they do suggest that there are inherent limitations in technological systems that may prevent them from achieving true general intelligence. To quote the final lines of Einstein's famous paper with Podolsky and Rosen:",
        "```",
        "While we have thus shown that the wave function",
        "does not provide a complete description of the physical reality,",
        "we left open the question of whether or not such a description exists.",
        "We believe, however, that such a theory is possible.",
        "```",
        "Similarly, computational representations of reality may also be inherently complete as is, but it is still left open whether or not a more complete representation exists. Besides, even if there is none, and AGI is in fact complete, that doesn't mean they haven't been insanely helpful tools regardless~",
        "",
        "<b>References</b>",
        [
          "Wikipedia. Artificial general intelligence. In Wikipedia, The Free Encyclopedia. [<a href=https://en.wikipedia.org/wiki/Artificial_general_intelligence>Link</a>]",
          "Raatikainen, Panu, \"Gödel's Incompleteness Theorems\", The Stanford Encyclopedia of Philosophy (Winter 2025 Edition), Edward N. Zalta & Uri Nodelman (eds.). [<a href=https://plato.stanford.edu/archives/win2025/entries/goedel-incompleteness/>Link</a>]",
          "Einstein, A., Podolsky, B., & Rosen, N. (1935). Can Quantum-Mechanical Description of Physical Reality Be Considered Complete?. Phys. Rev., 47, 777–780. [<a href=https://cds.cern.ch/record/405662/files/PhysRev.47.777.pdf>Link</a>]",
          "Sorin Bangu, Wittgenstein on Proof and Concept-Formation, The Philosophical Quarterly, Volume 75, Issue 1, January 2025, Pages 1–20. [<a href=https://doi.org/10.1093/pq/pqad111>Link</a>]"
        ]
      ]
    },
    {
      "header": "Turning a grain of rice into a black hole",
      "date": "10/26/2025",
      "paragraphs": [
        "<b><em>Vikram Ramavarapu</em> 10/26/2025</b>",
        "",
        "A grain of rice is pretty small, right? But considering that it's small:",
        [
          "If we keep it's mass, how small would it need to become to turn into a black hole?",
          "How heavy would it need to become to turn into a black hole?"
        ],
        "Let's answer the first question! First, we need to understand the Schawrzschild radius, which can be calculated using the formula:",
        "",
        "$$r_s = \\frac{2GM}{c^2}$$",
        "",
        "Great! Now let's assume that this is a grain of Jasmine rice, which has a mass of approximately $0.02$ grams (or $2 * 10^{-5}$ kg). And just to offend some people, I'm going let $G=10$ in classic engineer fashion (because $\\pi$ is also 3 amirite?). Plugging in the values, we get:",
        "",
        "$$r_s = \\frac{2 * 10 * 2 * 10^{-5}}{(3 * 10^8)^2} = 4.44 * 10^{-21} \\text{ meters}$$",
        "",
        "Okay yeah it looks like even for something as small as a grain of rice, the Schwarzschild radius is still insanely small. To put this into perspective, the radius of a proton is approximately $0.84 * 10^{-15}$ meters (According to Wikipedia), which is about $10^6$ times larger than the Schwarzschild radius we calculated for the grain of rice.",
        "Well, that's pretty interesting, but let's move on to the second question: How heavy would the grain of rice need to be to turn into a black hole, assuming it retains its original size?",
        "",
        "It's roughly the same calculation, but this time we need to solve for mass $M$ instead:",
        "",
        "$$M = \\frac{r_s c^2}{2G}$$",
        "",
        "Assuming the grain of rice has a radius of approximately $2$ millimeters (or $2 * 10^{-3}$ meters), we can plug in the values to get:",
        "",
        "$$M = \\frac{2 * 10^{-3} * (3 * 10^8)^2}{2 * 10} = 9 * 10^{12} \\text{ kg}$$",
        "",
        "That's pretty massive. Not to mention, this is a perfect and elaborate set up for a particular kind of joke, but unfortunately, I'd like to keep this journal entry somewhat professional.",
        "",
        "<b>#ViksJournal #Physics #BlackHoles</b>",
        "",
        "P.S. Looks like LaTeX rendering is working now! Yay~"
      ]
    },
    {
      "header": "Who even is this guy??",
      "date": "10/24/2025",
      "paragraphs": [
        "<b><em>Vikram Ramavarapu</em> 10/24/2025</b>",
        "",
        "Check out this stick man",
        "```",
        "      ____  ",
        "     /    \\ ",
        "    | o  o |",
        "    |  --  |",
        "     \\____/ ",
        "       ||   ",
        "      /  \\  ",
        "     /____\\ ",
        "```",
        "Does this stick man have a name? Who even is this guy??",
        "I'm not too sure myself...",
        "Who am I you ask? I'm text on a webpage. I'm a creation who sprouted from the guy who wrote me.",
        "",
        "You? And maybe even that aforementioned 'guy'? How do you know you're not all also mere figments of someone's imagination? Characters in their journal entry?",
        "",
        "You can feel? You can think? You can reflect on your own existence? How do you know your feelings, thoughts and reflections aren't but ideas akin to text on a webpage? What are feelings but electrical impulses in the brain after all?",
        "...",
        "But in the end of the day, does it really matter? Who even cares who I am? Maybe I'm just a stick man too.",
        "...",
        "Or a plane in the sky?",
        "```",
        "      __|__       ",
        "--@--@--(_)--@--@--",
        "```",
        "Or an astronaut floating in space?",
        "```",
        "      .-\"\"\"-.     ",
        "     /       \\    ",
        "    |  .-. .- |   ", 
        "    |  | | | |   ",
        "    |  | | | |   ",
        "    |  '-' '-'   ",
        "     \\_______/    ",  
        "      _|_|_|_     ",
        "     /_|_|_|_\\    ",
        "```",
        "I can be anything~ And maybe if you're also just text on a webpage, then so can you~~",
        "",
        "<b>#ViksJournal #OptimisticNihilism</b>",
        "P.S. No I did not make this entry simply to test out markdown rendering on my site."
      ]
    },
    {
      "header": "Technosolutionism",
      "date": "10/12/2025",
      "paragraphs": [
        "<b><em>Vikram Ramavarapu</em> 10/12/2025</b>",
        "",
        "It's been a while since I've written in my journal. Today I had some thoughts about this paper I read recently. If you want to read more, here's the link: <a href=\"https://sorelle.friedler.net/papers/sts_fat2019.pdf\">Fairness and Abstraction in Sociotechnical Systems</a>. The paper mentions these 'traps' in the design of a sociotechnical system, i.e. a system that is designed with the intention of being applied to a social context. One of these traps is 'technosolutionism', which is the ever so hopeful belief that every problem has a technological solution. Whenever I'm coming up with an idea for research or a project, I've often made it a point to try and work backwards from the application to the technology. With this in mind, I realize that sometimes I fall into the trap of technosolutionism, where I get excited about a new technology and believe it's the solution to a problem when it reality it may be the case that <b>no technology is needed at all</b>.",
        "",
        "Many times even, it seems that there have been cases of the 'illusion of a solution', where a technology is proposed as a solution to a problem, but it doesn't actually address the root cause of the problem. For example, the initial stages of the dot com bubble (~1990s) yielded many sociotechnical endeavors. One of which was the advent of dating apps, which many people thought would streamline the process of finding a partner and make it easier for people to connect (hell, my parents met on one). However, over time, it became clear that dating apps also introduced new problems, such as superficiality, objectification, and a focus on quantity over quality in relationships. In today's world, dating apps have attempted to sort of 'patch' these issues with features like detailed profiles, compatibility algorithms, and prompts to encourage more meaningful conversations. However, these solutions often feel like band-aids on a deeper issue of how technology can sometimes distort human connection rather than enhance it. The actual friction of the dating process is essential for human nature itself, and no amount of technology can change that fundamental truth. And just to generalize this point further, technology serves two main purposes:",
        [
          "To streamline an existing process or system, making it more efficient or effective.",
          "To enable the measurement of something that was previously difficult or impossible to measure."
        ],
        "With respect to the first point in particular, in many cases, friction is essential to the process itself. For example, the Estonian voting system became the first country to implement online voting in 2005. While the system may have streamlined the voting process, it was met with significant criticism and skepticism from the public, who were concerned about the security and integrity of the voting process. In this case, the friction of traditional voting methods (e.g., in-person voting, paper ballots) was seen as a necessary safeguard against fraud and manipulation. By removing this friction, the online voting system introduced new risks and vulnerabilities that undermined public trust in the electoral process. [<a href=\"https://en.wikipedia.org/wiki/Electronic_voting_in_Estonia\">Reference</a>]",
        "",
        "Some caveats to the aforementioned points:",
        [
          "I know people reading may be thinking that it's crazy that the CS PhD student is ragging on technology. But let me be clear that not all technological solutions are inherently bad or misguided. Many technologies have had a positive impact on society and have addressed real problems effectively.",
          "The effectiveness of a technological solution often depends on how well it is designed, implemented, and integrated into the social context it aims to address. I used to develop Alexa apps for older adults at a local retirement home. It made me realize how important it is to consider the approach and intent is a key component of the solution, rather than simply whether technology is being used or not."
        ],
        "Technosolutionism is an insanely difficult trap to avoid, especially due to the complexity of the trap itself. While the paper sparked a lot of these thoughts, there was definitely not enough space to explore it in depth. I think it's important to be aware of the potential pitfalls of technosolutionism and to approach technological solutions with a critical and reflective mindset. Considering some of these main points:",
        [
          "What does my system streamline or improve? Is this friction necessary to the process itself?",
          "Am I addressing the root cause of the problem, or just treating the symptoms?",
          "Am I considering the social context and potential unintended consequences of my solution?",
          "Does my approach and intent align with the needs and values of the community I'm trying to serve?"
        ],
        "By doing so, we can ensure that technology is used in a way that truly benefits society and addresses real problems effectively.",
        "I'll try to update this journal more often! With varying degrees of success and seriousness haha. Check out the other entry I have titled 'Recursion on a Trash Can' for a more lighthearted read :)",
        "<b>#ViksJournal</b>"
      ]
    },
    {
      "header": "Recursion on a Trash Can",
      "date": "8/25/2022",
      "paragraphs": [
        "<b><em>Vikram Ramavarapu</em> 8/25/2022</b>",
        "If you want to replace a trash can, you need to throw away the old trash can right?",
        "So where do you throw away the trash can if you intend to throw away the trash can you're trying to throw away the trash can in?",
        "I guess you can get the new trash can and throw away the old trash can in the new trash can...",
        "Yeah that works...",
        "<b>#ViksJournal</b>"
      ]
    }
  ]
}
