{
  "cards": [
    {
      "image": "assets/cm_pp_overview.png",
      "imageAlt": "CM++ Pipeline",
      "imageScale": 30,
      "paragraphs": [
        "<b>CM++ - A Pipeline for Well-Connected Community Detection</b>",
        "",
        "<a href=https://minhyukpark.com/>Minhyuk Park*</a>, <a href=https://ytabatabaee.github.io/>Yasamin Tabatabaee*</a>, <b>Vikram Ramavarapu*</b>, <a href=https://runeblaze.github.io/>Baqiao Liu</a>, <a href=https://www.linkedin.com/in/kamathvidyapailodi/>Vidya Kamath Pailodi</a>, <a href=https://www.linkedin.com/in/rajiv-ramachandran/>Rajiv Ramachandran</a>, <a href=https://www.linkedin.com/in/dkroot/>Dmitriy Korobskiy</a>, <a href=https://www.linkedin.com/in/fabio-ayres-72a55427/?originalSubdomain=br>Fabio Ayres</a>, <a href=https://sites.google.com/view/chackogroup/home>George Chacko</a>, <a href=https://tandy.cs.illinois.edu/>Tandy Warnow</a>",
        "<em>PLOS Complex Systems (2024)</em>",
        "[<a href=https://journals.plos.org/complexsystems/article?id=10.1371/journal.pcsy.0000009>Paper</a>]",
        "",
        "<b>Vikram Ramavarapu</b>, <a href=https://www.linkedin.com/in/fabio-ayres-72a55427/?originalSubdomain=br>Fabio Ayres</a>, <a href=https://minhyukpark.com/>Minhyuk Park*</a>, <a href=https://www.linkedin.com/in/kamathvidyapailodi/>Vidya Kamath Pailodi</a>, <a href=https://alfredjynx.github.io/>João Alfredo Cardoso Lamy</a>, <a href=https://tandy.cs.illinois.edu/>Tandy Warnow</a>, <a href=https://sites.google.com/view/chackogroup/home>George Chacko</a>",
        "<em>Journal of Open Source Software (JOSS) (2024)</em>",
        "[<a href=https://joss.theoj.org/papers/10.21105/joss.06073.pdf>Paper</a>]",
        "",
        "Community detection is the process of partitioning a very large graph into smaller \"meso-scale\" subgraphs. The definition of a \"good\" community is very amorphous. As such we created a generalizable community detection pipeline that allows users to switch between stages of operations (community detection with their specified algorithm, size filtering, tree filtering, statistics computation). We also created a stage in the pipeline that \"chisels\" computed communities into well-connected communities (illustrated below) through pruning and mincut operations.",
        "<a href=\"https://illinois-or-research-analytics.github.io/cm_pipeline/\" class=\"btn btn-primary\">Go to Docs Page!</a>",
        "<a href=\"https://github.com/illinois-or-research-analytics/cm_pipeline\" class=\"btn btn-primary\">View Source Code!</a>"
      ]
    },
    {
      "image": "assets/multiling.png",
      "imageAlt": "Multilingual Citation Network",
      "paragraphs": [
        "<b>Understanding Community Formation in Science through Cross-lingual Citation</b>",
        "This project was worked on mainly during my time at the National Institute of Informatics (国立情報学研究所) in Tokyo, under the guidance of Prof. Chifumi Nishioka.",
        "In this project, we explored how cross lingual citation can divide a research citation into communities. Moreover, we explored how messenger nodes across languages can bridge communities. We used a dataset of 7 million papers from a corroborated dataset across OpenCitations, CrossRef, and OpenAlex.",
        "<em>Image: A visualization of a citation network across languages. Each color represents a different language, and the size of the node represents the number of citations the paper has. NOTE: This is a mockup and not the actual visualization.</em>"
      ]
    },
    {
      "image": "assets/migration.jpeg",
      "imageAlt": "Migration History",
      "imageWidth": "425",
      "imageHeight": "325",
      "paragraphs": [
        "<b>Migration History Inference of Metastatic Cancers</b>",
        "I have also been working with Prof. Mohammed El-Kebir on using clonal trees inferred from variant allele frequencies (VAFs) to infer anatomic labelings of nodes in the clonal tree and ultimately a migration graph. Since his paper on <a href=\"https://github.com/raphael-group/machina\">MACHINA</a> in 2018, we have expanded the solution space to return multiple possible migration histories per primary tumor location.",
        "I created this <a href=\"https://elkebir-group.github.io/mach2-viz/#/\">visualizer</a>. More than simply providing visual aid for the algorithm, it allows users (researchers, oncologists, etc.) to filter through the solution space and enforce priors such as known migrations and/or absences of migrations.",
        "<em>Image: Migration history inferred for a patient recorded in the <a href=\"http://tracerx.co.uk/studies/lung/\">TracerX</a> consortium.</em>"
      ]
    },
    {
      "image": "assets/choropleth.jpeg",
      "imageAlt": "COVID Cyclicity",
      "imageWidth": "500",
      "paragraphs": [
        "<b>Cyclicity Analysis on COVID in North America</b>",
        "Cyclicity analysis is the technique of aggregating regional linear time series to map spread of a signal over a medium. Cyclicity analysis was traditionally used in neuroscience to infer spread of a signal across the brain given individual synaptic potentials.",
        "However, we now use Cyclicity Analysis to understand the spread of different variants of COVID. Using American and Canadian provincial COVID case time series, spread is mapped across North America.",
        "<em>Image: Inferred spread of the Delta variant of COVID. Redder colors indicate earlier states in the wave, and bluer colors indicate later states in the wave.</em>"
      ]
    }
  ]
}
