{
  "cards": [
    {
      "image": "assets/citation_rat.png",
      "imageAlt": "Citation Rat",
      "imageWidth": "400",
      "imageHeight": "400",
      "paragraphs": [
        "<b>Scientometrics and Network Science</b>",
        "Currently, under the guidance of Prof. George Chacko and Prof. Tandy Warnow, I am working with large networks of research papers linked through citation. The largest network I have worked with was a citation network of ~75 million nodes and ~1 billion edges (OpenCitations). The specific projects I'm working on are below:",
        "<ul><li>High-performance well-connected community detection (<a href=\"https://github.com/illinois-or-research-analytics/cm_pipeline\">link</a>)</li><li>Using multi-dimensional metrics to analyze publication impact both at the community and network scale</li><li>Simulating citation network growth and encoding citation behavior.</li></ul>",
        "<br>",
        ".",
        "<em>Image: A rat made out of citations. Each node is a paper, and each edge is a citation. A lab rat who is merely trying to understand its own behavior.</em>",
        "<em>Image generated by DALL-E</em>"
      ]
    },
    {
      "image": "assets/multiling.png",
      "imageAlt": "Multilingual Citation Network",
      "paragraphs": [
        "<b>Understanding Community Formation in Science through Cross-lingual Citation</b>",
        "This project was worked on mainly during my time at the National Institute of Informatics (国立情報学研究所) in Tokyo, under the guidance of Prof. Chifumi Nishioka.",
        "In this project, we explored how cross lingual citation can divide a research citation into communities. Moreover, we explored how messenger nodes across languages can bridge communities. We used a dataset of 7 million papers from a corroborated dataset across OpenCitations, CrossRef, and OpenAlex.",
        "<em>Image: A visualization of a citation network across languages. Each color represents a different language, and the size of the node represents the number of citations the paper has. NOTE: This is a mockup and not the actual visualization.</em>"
      ]
    },
    {
      "image": "assets/migration.jpeg",
      "imageAlt": "Migration History",
      "imageWidth": "425",
      "imageHeight": "325",
      "paragraphs": [
        "<b>Migration History Inference of Metastatic Cancers</b>",
        "I have also been working with Prof. Mohammed El-Kebir on using clonal trees inferred from variant allele frequencies (VAFs) to infer anatomic labelings of nodes in the clonal tree and ultimately a migration graph. Since his paper on <a href=\"https://github.com/raphael-group/machina\">MACHINA</a> in 2018, we have expanded the solution space to return multiple possible migration histories per primary tumor location.",
        "I created this <a href=\"https://elkebir-group.github.io/mach2-viz/#/\">visualizer</a>. More than simply providing visual aid for the algorithm, it allows users (researchers, oncologists, etc.) to filter through the solution space and enforce priors such as known migrations and/or absences of migrations.",
        "<em>Image: Migration history inferred for a patient recorded in the <a href=\"http://tracerx.co.uk/studies/lung/\">TracerX</a> consortium.</em>"
      ]
    },
    {
      "image": "assets/choropleth.jpeg",
      "imageAlt": "COVID Cyclicity",
      "imageWidth": "500",
      "paragraphs": [
        "<b>Cyclicity Analysis on COVID in North America</b>",
        "Cyclicity analysis is the technique of aggregating regional linear time series to map spread of a signal over a medium. Cyclicity analysis was traditionally used in neuroscience to infer spread of a signal across the brain given individual synaptic potentials.",
        "However, we now use Cyclicity Analysis to understand the spread of different variants of COVID. Using American and Canadian provincial COVID case time series, spread is mapped across North America.",
        "<em>Image: Inferred spread of the Delta variant of COVID. Redder colors indicate earlier states in the wave, and bluer colors indicate later states in the wave.</em>"
      ]
    }
  ]
}
